
export const TEACHERS = [
  "أحمد إبراهيم علام الخولي", "أحمد بن سالم بن سعيد الجامودي", "أحمد بن سالم بن سليمان السالمى", "أحمد عبدالله على عبدالله", "أرسانيوس جوزيف شحاته كيرلس",
  "أسامة محمد العادل القسنطيني", "الحسين بن محمد الصغير سعودي", "أنور بن ربيع بن علي الجامودي", "إسحاق حمد الرحبي", "أحمد بن محمد بن خلفان الفهدي",
  "أحمد بن محمد بن راشد الشبلي", "أحمد بن محمد بن سالم الجامودي", "أحمد بن مسعود بن ساعد الكندي", "أحمد قرني أحمد شاكر", "أويس البوسعيدي",
  "باهي بن عبدالله بن سعيد الدرعي", "جمعه بن سعيد بن خلفان الحراصي", "حاتم بن سليمان بن حمد السيفي", "حسن اسماعيل عبدالعزيز", "خالد بن محمد بن سيف النبهاني (رياضة)",
  "خالد سيد عبد المجيد سيد", "خلفان بن خليفه بن محمد المعمري", "خلفان بن سعود بن مهنا الهاشمي", "راشد بن عبدالله بن زاهر الجامودي", "راشد بن عيسى الخروصي",
  "زاهر بن هلال بن محمد الريامي", "سالم بن حمد بن سالم المفضلي", "سالم بن حمد بن محمد العبادي", "سالم بن محمد بن عامر الشريقي", "سامى بن مسلم بن سالم السليمى",
  "سعود بن عبدالله بن محمد الجامودي", "سعيد بن حمود بن علي العويمري", "سعيد بن علي بن عبدالله الجامودي", "سعيد حسن الانور", "سليمان بن سالم بن ناصرالخروصي",
  "سليمان بن محمد بن سعيد السالمي", "سليمان بن محمد بن سليمان الصباري", "سيف بن ابراهيم بن أحمد الخروصي", "شريف عادل علي محمد", "ضاوي بن سالم بن محمد الفلاحي",
  "عامر بن سعيد بن فريش الهنائى", "عبدالله بن حمد بن سعيد النبهانى", "عبدالله بن سليمان بن عبدالله العزري", "عبدالله بن محمد بن عبدالله الهذيلي", "عدنان بن علي بن سيف السالمي",
  "على سيد نظيف عبد العال", "علي بن خلفان بن سعيد الكندي", "علي بن سالم بن محمد السالمي", "علي بن سيف بن سالم الكمياني", "عمّار عمر عامر حمود الشريقي",
  "عمرو محمد عبدالعزيز جمعة", "فيّاض بن راشد بن خلفان الهنائي", "كريم بن محسن بلقاسم", "مازن بن هارون بن عوض النبهاني", "مجدي خلف معروف حسين",
  "محفوظ بن طوير بن العبد اليعربي", "محمد السيد محمد محمد", "محمد بن السو بن سالم الريامي", "محمد بن سالم بن ضاوي الشريقي", "محمد بن سالم بن محمد النبهاني",
  "محمد بن سعيد السالمي", "محمد بن سليمان بن مسلم الحضرمي", "محمد بن سيف بن ناصر العبدلي", "محمد بن عبدالله بن حامد العبادى", "محمد بن مسعود بن حريب التوبي",
  "محمد حسب الله الامين محمد", "محمد حفنى على دربالة", "محمد عبد العاطى احمد قاسم", "محمد علي احمد سلامه", "محمد علي عطا الله",
  "محمد علي عيسى", "محمد فوزي مختار طلوبة", "محمود الزاهى محمود رمضان", "محمود حمدي محمد سعيد", "مسعود بن حمد بن علي القسيمي",
  "مصطفى احمد هاشم احمد", "معز بن طاهر عمري عمري", "منذر محمد علي الزرلي", "ناصر بن ربيعة بن أحمد الكندي", "ناصر بن سعيد بن خميس المخاشنى",
  "ناصر بن سعيد بن ناصر الكندي", "نبيل محفوظ قطب محمد مطاوع", "هاني محمد عبدالمنعم محمد", "هلال بن خليفة بن ناصر الكندي", "هلال بن سالم بن علي الريامي",
  "وليد بن سالم بن سعيد الكندى", "يعقوب بن محمد بن خلفان البوسعيدي", "يوسف بن سالم بن سويلم الوائلى"
];

export const SUBJECTS = [
  "التربية الإسلامية", "اللغة العربية", "اللغة الإنجليزية", "الدراسات الاجتماعية", "الرياضيات",
  "الفيزياء", "الكيمياء", "الأحياء", "العلوم البيئية", "الجغرافيا",
  "التاريخ", "الفنون التشكيلية", "المهارات الموسيقة", "الرياضة المدرسية", "تقنية المعلومات",
  "السفر والسياحة", "التوجيه المهني", "المهارات الحياتية", "مسؤول مركز مصادر التعلم"
];

export const GRADES = {
  "10": Array.from({ length: 11 }, (_, i) => `${i + 1}/10`).concat("أخرى"),
  "11": Array.from({ length: 11 }, (_, i) => `${i + 1}/11`).concat("أخرى"),
  "12": Array.from({ length: 11 }, (_, i) => `${i + 1}/12`).concat("أخرى"),
};

export const PASSWORD = "2410";
